InformationRegisters/КвизРезультаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>КвизРезультаты</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сессия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вопрос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КвизРезультаты/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция СписокПередУдалениемНаСервере(Параметры)
	Попытка
		НЗ = РегистрыСведений.КвизРезультаты.СоздатьНаборЗаписей();
		НЗ.Отбор.Период.Установить(Параметры.Период);
		НЗ.Отбор.Сессия.Установить(Параметры.Сессия);
		НЗ.ОбменДанными.Загрузка	= Истина;
		НЗ.Записать();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	Если СписокПередУдалениемНаСервере(Новый Структура("Период,Сессия", Элемент.ТекущиеДанные.Период, Элемент.ТекущиеДанные.Сессия)) Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	НаКлиенте.Показать(Элемент.ТекущиеДанные.Вопрос, СтандартнаяОбработка);
КонецПроцедуры
